src/DataProcessors/ИС_Ozon_ВыгрузкаКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_Ozon_ВыгрузкаКарточек</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеЗначенийХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеЗначенийХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристикиOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_ЗначенияХарактеристик</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_ЗначенияХарактеристикПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_ЗначенияХарактеристикПоКатегориям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_ЗначенияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_ВидРеквизитаСопоставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_ВидРеквизитаСопоставления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвойствоНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИС_Ozon_ВыгрузкаКарточек/Forms/ФормаСопоставленияЗначений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("ХарактеристикаOzon", ХарактеристикаOzon);
	Параметры.Свойство("ВидРеквизита1С", ВидРеквизита1С);
	Параметры.Свойство("Реквизит1С", Реквизит1С);
	Параметры.Свойство("НаборЗначений", НаборЗначений);

	ЗаполнитьСопоставлениеПоХарактеристике();

	Если НаборЗначений Тогда
		Элементы.СопоставленниеЗначенийЗначениеХарактеристикиOzon.ОграничениеТипа	 = Новый ОписаниеТипов("СписокЗначений");
	Иначе
		Элементы.СопоставленниеЗначенийЗначениеХарактеристикиOzon.ОграничениеТипа	 = Новый ОписаниеТипов("Строка", ,
			Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
		МассивСвязей = Новый Массив;
		НоваяСвязь = Новый СвязьПараметраВыбора("Характеристика", "ХарактеристикаOzon");
		МассивСвязей.Добавить(НоваяСвязь);
		НоваяСвязь = Новый СвязьПараметраВыбора("Категория", "Категория");
		МассивСвязей.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
		Элементы.СопоставленниеЗначенийЗначениеХарактеристикиOzon.СвязиПараметровВыбора = НовыеСвязи;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставленныеЗначения

&НаКлиенте
Процедура СопоставленныеЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставленниеЗначенийЗначениеХарактеристикиOzonНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("Характеристика", ХарактеристикаOzon);

	Если НаборЗначений Тогда

		ТекущаяСтрока = Элементы.СопоставленныеЗначения.ТекущиеДанные;
		Если ТипЗнч(ТекущаяСтрока.ЗначениеХарактеристикиOzon) = Тип("СписокЗначений") Тогда
			ВыбранныеЗначения = ТекущаяСтрока.ЗначениеХарактеристикиOzon.ВыгрузитьЗначения();
		Иначе
			ВыбранныеЗначения = Новый Массив;
			Если ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеХарактеристикиOzon) Тогда
				ВыбранныеЗначения.Добавить(ТекущаяСтрока.ЗначениеХарактеристикиOzon);
			КонецЕсли;
			ТекущаяСтрока.ЗначениеХарактеристикиOzon = Новый СписокЗначений;
		КонецЕсли;

		СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);

		ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ОткрытьФорму("Справочник.ИС_Ozon_ЗначенияХарактеристик.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СопоставленниеЗначенийЗначениеХарактеристикиOzonОбработкаВыбора(Элемент, ВыбранноеЗначение,
	СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.СопоставленныеЗначения.ТекущиеДанные;

	СтандартнаяОбработка = Ложь;
	Если НаборЗначений Тогда
		ТекущаяСтрока.ЗначениеХарактеристикиOzon.ЗагрузитьЗначения(ВыбранноеЗначение);
	Иначе
		ТекущаяСтрока.ЗначениеХарактеристикиOzon = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьАвтоматически(Команда)

	СопоставитьАвтоматическиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПодобные(Команда)
	СопоставитьАвтоматическиНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	СохранитьНаСервере();
	Закрыть();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьАвтоматическиНаСервере(ПолноеСоответствие = Истина)

	Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыХарактеристики = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыХарактеристики Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда

		ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");

	Иначе

		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит1С, "ТипЗначения");

	КонецЕсли;

	Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипРеквизита) Или Метаданные.Перечисления.Содержит(
		Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0])) Тогда

		СопоставитьПоЗначениямПримитивногоТипа(ПолноеСоответствие);
	Иначе
		СопоставитьПоЗначениямСвойствОбъектов(ПолноеСоответствие);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()

	НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.ХарактеристикаOzon.Установить(ХарактеристикаOzon);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для Каждого стр Из СопоставлениеЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеХарактеристикиOzon) Тогда

			Запись = НаборЗаписей.Добавить();
			Запись.Категория 					= Категория;
			Запись.ХарактеристикаOzon 			= ХарактеристикаOzon;
			Запись.ВидРеквизита1С 				= ВидРеквизита1С;
			Запись.Реквизит1С 					= Реквизит1С;

			Если ТипЗнч(стр.ЗначениеХарактеристикиOzon) = Тип("СписокЗначений") Тогда
				значение = ЗначенияВСтроку(стр.ЗначениеХарактеристикиOzon.ВыгрузитьЗначения());
				Если ЗначениеЗаполнено(значение) Тогда
					Запись.ЗначениеХарактеристикиOzon 	= значение;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				Запись.ЗначениеХарактеристикиOzon 	= стр.ЗначениеХарактеристикиOzon;
			КонецЕсли;

			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипЗнч(стр.ЗначениеВ1С)) Тогда
				Запись.ЗначениеХарактеристики 	= стр.ЗначениеВ1С;
			Иначе
				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(стр.ЗначениеВ1С));
				Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
					Запись.ЗначениеХарактеристики = Строка(стр.ЗначениеВ1С.УникальныйИдентификатор());
				ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
					Запись.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Индекс(стр.ЗначениеВ1С) + 1;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Категория 			= Категория;
		Запись.ХарактеристикаOzon 	= ХарактеристикаOzon;
	КонецЕсли;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеПоХарактеристике()

	ТаблицаСоответствий = ИС_Ozon_Сервер.ТаблицаСоответствийЗначений(Категория, ХарактеристикаOzon,
		ВидРеквизита1С, Реквизит1С);
	Для Каждого стр Из ТаблицаСоответствий Цикл

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = стр.ЗначениеВ1С;

		Если ЗначениеЗаполнено(стр.ЗначениеХарактеристикиOzon) Тогда

			Если НаборЗначений Тогда

				Если ТипЗнч(стр.ЗначениеХарактеристикиOzon) = Тип("Строка") Тогда
					МассивЗначений = ИС_Ozon_Сервер.ЗначенияХарактеристикиOzonИзСтроки(
						стр.ЗначениеХарактеристикиOzon);
				Иначе
					МассивЗначений = Новый Массив;
					МассивЗначений.Добавить(стр.ЗначениеХарактеристикиOzon);
				КонецЕсли;

				НоваяСтрока.ЗначениеХарактеристикиOzon = Новый СписокЗначений;
				НоваяСтрока.ЗначениеХарактеристикиOzon.ЗагрузитьЗначения(МассивЗначений);

			Иначе

				НоваяСтрока.ЗначениеХарактеристикиOzon = стр.ЗначениеХарактеристикиOzon;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	СопоставлениеЗначений.Сортировать("ЗначениеВ1С");

КонецПроцедуры

&НаСервере
Процедура СопоставитьПоЗначениямПримитивногоТипа(ПолноеСоответствие)

	Если ПолноеСоответствие Тогда
		Условие = "ПО вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С = вт_ЗначенияOzon.Наименование";
	Иначе
		Условие = "ПО вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С Подобно ""%"" + вт_ЗначенияOzon.Наименование + ""%""
				  |	ИЛИ вт_ЗначенияOzon.Наименование Подобно ""%"" + вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С + ""%""";
	КонецЕсли;

	ТабЗнач = СопоставлениеЗначений.Выгрузить().Скопировать();
	ТабЗнач.Колонки.Добавить("ПредставлениеЗначениеВ1С", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150,
		ДопустимаяДлина.Переменная)));

	Для Каждого стр Из ТабЗнач Цикл
		Если ТипЗнч(стр.ЗначениеВ1С) = Тип("Строка") Тогда
			стр.ПредставлениеЗначениеВ1С = стр.ЗначениеВ1С;
		Иначе
			стр.ПредставлениеЗначениеВ1С = Формат(стр.ЗначениеВ1С,
				"ЧРД=,; ЧРГ=; ЧГ=0; ДФ=dd.MM.yyyy; БЛ=false; БИ=true");
		КонецЕсли;
	КонецЦикла;

	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Категория);
	МассивКатегорий.Добавить(ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка"));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаOzon);
	Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);

	Запрос.Текст = "ВЫБРАТЬ
				   |	ТабЗнач.ЗначениеВ1С КАК ЗначениеВ1С,
				   |	ТабЗнач.ПредставлениеЗначениеВ1С КАК ПредставлениеЗначениеВ1С
				   |ПОМЕСТИТЬ вт_СопоставленныеЗначения
				   |ИЗ
				   |	&ТабЗнач КАК ТабЗнач
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Ozon_ЗначенияХарактеристик.Наименование КАК Наименование,
				   |	Ozon_ЗначенияХарактеристик.Ссылка КАК Ссылка
				   |ПОМЕСТИТЬ вт_ЗначенияOzon
				   |ИЗ
				   |	Справочник.ИС_Ozon_ЗначенияХарактеристик КАК Ozon_ЗначенияХарактеристик
				   |ГДЕ
				   |	Ozon_ЗначенияХарактеристик.Ссылка В
				   |			(ВЫБРАТЬ
				   |				Ozon_ЗначенияХарактеристикПоКатегориям.ЗначениеХарактеристики КАК ЗначениеХарактеристики
				   |			ИЗ 
				   //+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81572				   
				   //|				РегистрСведений.Ozon_ЗначенияХарактеристикПоКатегориям КАК Ozon_ЗначенияХарактеристикПоКатегориям
				   |				РегистрСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям КАК Ozon_ЗначенияХарактеристикПоКатегориям
				   //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81572
				   |			ГДЕ
				   |				Ozon_ЗначенияХарактеристикПоКатегориям.Категория В (&МассивКатегорий)
				   |				И Ozon_ЗначенияХарактеристикПоКатегориям.Характеристика = &Характеристика)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	вт_СопоставленныеЗначения.ЗначениеВ1С КАК ЗначениеВ1С,
				   |	вт_ЗначенияOzon.Ссылка КАК СопоставленноеЗначениеOzon
				   |ИЗ
				   |	вт_СопоставленныеЗначения КАК вт_СопоставленныеЗначения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗначенияOzon КАК вт_ЗначенияOzon
				   |		" + Условие;
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СопоставлениеЗначений.Очистить();
	ПредыдущееЗначение = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если ПредыдущееЗначение = Выборка.ЗначениеВ1С Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = Выборка.ЗначениеВ1С;

		Если Не ЗначениеЗаполнено(Выборка.СопоставленноеЗначениеOzon) Тогда
			Продолжить;
		КонецЕсли;

		Если НаборЗначений Тогда
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(Выборка.СопоставленноеЗначениеOzon);
			НоваяСтрока.ЗначениеХарактеристикиOzon = Новый СписокЗначений;
			НоваяСтрока.ЗначениеХарактеристикиOzon.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			НоваяСтрока.ЗначениеХарактеристикиOzon = Выборка.СопоставленноеЗначениеOzon;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СопоставитьПоЗначениямСвойствОбъектов(ПолноеСоответствие)

	Если ПолноеСоответствие Тогда
		Условие = "ПО вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование = вт_ЗначенияOzon.Наименование";
	Иначе
		Условие = "ПО вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование Подобно ""%"" + вт_ЗначенияOzon.Наименование + ""%""
				  |	ИЛИ вт_ЗначенияOzon.Наименование Подобно ""%"" + вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование + ""%""";
	КонецЕсли;

	ТабЗнач = СопоставлениеЗначений.Выгрузить();
	Если ТабЗнач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТипЗначения = ТабЗнач[0].ЗначениеВ1С.Метаданные().ПолноеИмя();

	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Категория);
	МассивКатегорий.Добавить(ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка"));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаOzon);
	Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВЫРАЗИТЬ (ТабЗнач.ЗначениеВ1С КАК " + ТипЗначения + ") КАК ЗначениеВ1С
																			|ПОМЕСТИТЬ вт_СопоставленныеЗначения
																			|ИЗ
																			|	&ТабЗнач КАК ТабЗнач
																			|;
																			|
																			|////////////////////////////////////////////////////////////////////////////////
																			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
																			|	Ozon_ЗначенияХарактеристик.Наименование КАК Наименование,
																			|	Ozon_ЗначенияХарактеристик.Ссылка КАК Ссылка
																			|ПОМЕСТИТЬ вт_ЗначенияOzon
																			|ИЗ
																			|	РегистрСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям КАК Ozon_ЗначенияХарактеристикПоКатегориям
																			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_ЗначенияХарактеристик КАК Ozon_ЗначенияХарактеристик
																			|		ПО Ozon_ЗначенияХарактеристикПоКатегориям.ЗначениеХарактеристики = Ozon_ЗначенияХарактеристик.Ссылка
																			|ГДЕ
																			|	Ozon_ЗначенияХарактеристикПоКатегориям.Категория В (&МассивКатегорий)
																			|			И Ozon_ЗначенияХарактеристикПоКатегориям.Характеристика = &Характеристика
																			|;
																			|
																			|////////////////////////////////////////////////////////////////////////////////
																			|ВЫБРАТЬ
																			|	вт_СопоставленныеЗначения.ЗначениеВ1С КАК ЗначениеВ1С,
																			|	вт_ЗначенияOzon.Ссылка КАК СопоставленноеЗначениеOzon
																			|ИЗ
																			|	вт_СопоставленныеЗначения КАК вт_СопоставленныеЗначения
																			|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗначенияOzon КАК вт_ЗначенияOzon
																			|		" + Условие;
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СопоставлениеЗначений.Очистить();
	ПредыдущееЗначение = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если ПредыдущееЗначение = Выборка.ЗначениеВ1С Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = Выборка.ЗначениеВ1С;

		Если Не ЗначениеЗаполнено(Выборка.СопоставленноеЗначениеOzon) Тогда
			Продолжить;
		КонецЕсли;

		Если НаборЗначений Тогда
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(Выборка.СопоставленноеЗначениеOzon);
			НоваяСтрока.ЗначениеХарактеристикиOzon = Новый СписокЗначений;
			НоваяСтрока.ЗначениеХарактеристикиOzon.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			НоваяСтрока.ЗначениеХарактеристикиOzon = Выборка.СопоставленноеЗначениеOzon;
		КонецЕсли;

		ПредыдущееЗначение = Выборка.Значениев1С;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗначенияВСтроку(МассивЗначений)

	Результат = "";
	Для Каждого значение Из МассивЗначений Цикл
		Если ЗначениеЗаполнено(значение) Тогда
			Результат = Результат + Строка(значение.УникальныйИдентификатор()) + ";";
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
